Catalogs/ПрограммыОбученияСотрудниковПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыОбученияСотрудниковПоОхранеТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбученияМинтруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПрограммОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитсяПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляВсехРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСОтрывомОтПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСменуРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПодчиненностьПодразделенийОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодчиненностьПодразделенийОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВышестоящееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПрограммыОбученияСотрудниковПоОхранеТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.РабочиеМеста КАК Т1
	|	ПО Т1.Ссылка = Т.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК Т2 
	|	ПО Т2.Подразделение = Т1.Подразделение
	|;
	|РазрешитьЧтение
	|ГДЕ
	|	ИСТИНА
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	(Т1.Организация ЕСТЬ NULL
	|		ИЛИ ДляВсехСтрок(ЗначениеРазрешено(Т1.Организация)))
	|	И (Т1.Подразделение ЕСТЬ NULL
	|		ИЛИ ДляВсехСтрок(
	|			ЗначениеРазрешено(Т2.Подразделение)
	|			ИЛИ ДляОднойИзСтрок(ЗначениеРазрешено(Т2.ВышестоящееПодразделение))))";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ОхранаТруда");
КонецПроцедуры

#КонецОбласти

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект, Замещение = Неопределено) Экспорт
	
	Если Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеЗначения = ЗначенияРеквизитовПрограммыОбученияПередЗаписью(Объект.Ссылка);
	Объект.ДополнительныеСвойства.Вставить("ПрежниеЗначения", ПрежниеЗначения);
	
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект, Замещение = Неопределено) Экспорт
	
	ПрежниеЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "ПрежниеЗначения");
	Если ЗначениеЗаполнено(ПрежниеЗначения) Тогда
		ОбновитьПериодическиеОбученияПоОхранеТруда(ПрежниеЗначения, Объект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияРеквизитовПрограммыОбученияПередЗаписью(СсылкаНаОбъект) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект,
		"ПометкаУдаления, КонтролироватьПроведение, КонтролироватьСменуРабочегоМеста, ИспользоватьДляВсехРабочихМест, ПредставлениеПериода, РабочиеМеста");
КонецФункции

Процедура ОбновитьПериодическиеОбученияПоОхранеТруда(ПрежниеЗначенияРеквизитов, ПрограммаОбъект) Экспорт
	
	Если ПрограммаОбъект.ПометкаУдаления И ПрежниеЗначенияРеквизитов.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	РезультатАнализа = АнализИзмененийПрограммы(ПрежниеЗначенияРеквизитов, ПрограммаОбъект);
	
	Если Не РезультатАнализа.ТребуетсяОбновление Тогда
		Возврат;
	КонецЕсли;
	
	ОбучениеПоОхранеТруда.ОбновитьПериодическиеОбученияРабочихМест(
		СсылкаНаПрограмму(ПрограммаОбъект), РезультатАнализа.РабочиеМестаДляОбновления);
	
КонецПроцедуры

// Анализирует изменения в программе обучения и определяет необходимость обновления периодических обучений
//
// Параметры:
//  ПрежниеЗначения - Структура - прежние значения реквизитов программы
//  ПрограммаОбъект - СправочникОбъект.ПрограммыОбученияСотрудниковПоОхранеТруда - 
//
// Возвращаемое значение:
//  Структура:
//   * ТребуетсяОбновление - Булево - 
//   * РабочиеМестаДляОбновления - Неопределено, Массив Из СправочникСсылка.РабочиеМестаОхраныТруда - 
//                 Если Неопределено, обновляются все рабочие места программы.
//                 Если пустой массив, обновление не выполняется.
//
Функция АнализИзмененийПрограммы(ПрежниеЗначения, ПрограммаОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяОбновление", Ложь);
	Результат.Вставить("РабочиеМестаДляОбновления", Неопределено);
	
	Если ПрежниеЗначения.ИспользоватьДляВсехРабочихМест <> ПрограммаОбъект.ИспользоватьДляВсехРабочихМест Тогда
		Результат.ТребуетсяОбновление = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Если ПрежниеЗначения.КонтролироватьСменуРабочегоМеста <> ПрограммаОбъект.КонтролироватьСменуРабочегоМеста Тогда
		Результат.ТребуетсяОбновление = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПрограммаОбъект.ИспользоватьДляВсехРабочихМест Тогда
		Если ПрограммаОбъект.ЭтоНовый() Тогда
			Результат.ТребуетсяОбновление = Истина;
			Результат.РабочиеМестаДляОбновления = ПрограммаОбъект.РабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
		Иначе
			РабочиеМестаДо = ПрежниеЗначения.РабочиеМеста.Выгрузить().ВыгрузитьКолонку("РабочееМесто");
			РабочиеМестаПосле = ПрограммаОбъект.РабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
			
			Если Не ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(РабочиеМестаДо, РабочиеМестаПосле, Истина) Тогда
				Результат.ТребуетсяОбновление = Истина;
				Результат.РабочиеМестаДляОбновления = ИзмененныеРабочиеМеста(РабочиеМестаДо, РабочиеМестаПосле);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Результат.ТребуетсяОбновление Тогда
		Если ПрежниеЗначения.ПредставлениеПериода <> ПрограммаОбъект.ПредставлениеПериода
			Или ПрежниеЗначения.КонтролироватьПроведение <> ПрограммаОбъект.КонтролироватьПроведение Тогда
			
			Результат.ТребуетсяОбновление = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив рабочих мест, которые были добавлены или удалены
//
// Параметры:
//  РабочиеМестаДо - Массив Из СправочникСсылка.РабочиеМестаОхраныТруда - список рабочих мест до изменения
//  РабочиеМестаПосле - Массив Из СправочникСсылка.РабочиеМестаОхраныТруда - список рабочих мест после изменения
//
// Возвращаемое значение:
//  Массив Из СправочникСсылка.РабочиеМестаОхраныТруда - объединенный список добавленных и удаленных рабочих мест
//
Функция ИзмененныеРабочиеМеста(РабочиеМестаДо, РабочиеМестаПосле)
	
	ДобавленныеРабочиеМеста = ОбщегоНазначенияКлиентСервер.РазностьМассивов(РабочиеМестаПосле, РабочиеМестаДо);
	УдаленныеРабочиеМеста = ОбщегоНазначенияКлиентСервер.РазностьМассивов(РабочиеМестаДо, РабочиеМестаПосле);
	
	ИзмененныеРабочиеМеста = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИзмененныеРабочиеМеста, ДобавленныеРабочиеМеста, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИзмененныеРабочиеМеста, УдаленныеРабочиеМеста, Истина);
	
	Возврат ИзмененныеРабочиеМеста;
	
КонецФункции

// Ссылка на программу обучения
//
// Параметры:
//  ПрограммаОбъект - СправочникОбъект.ПрограммыОбученияСотрудниковПоОхранеТруда - объект программы
//
// Возвращаемое значение:
//  СправочникСсылка.ПрограммыОбученияСотрудниковПоОхранеТруда - ссылка на программу
//
Функция СсылкаНаПрограмму(ПрограммаОбъект)
	
	СсылкаНаПрограмму = ПрограммаОбъект.Ссылка;
	
	Если ПрограммаОбъект.ЭтоНовый() И Не ЗначениеЗаполнено(СсылкаНаПрограмму) Тогда
		СсылкаНаПрограмму = ПрограммаОбъект.ПолучитьСсылкуНового();
		
		Если Не ЗначениеЗаполнено(СсылкаНаПрограмму) Тогда
			СсылкаНаПрограмму = ПолучитьСсылку();
			ПрограммаОбъект.УстановитьСсылкуНового(СсылкаНаПрограмму);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаПрограмму;
	
КонецФункции

#КонецОбласти

#КонецЕсли
